{
    "juan": {
        "color": "Juan",
        "name": "Juan Escalada",
        "about": "I’m a technology enthusiast exploring different paths in the software industry. My favourite topics are: Game development, DevOps/SRE, VR, Systems Architecture and Backend development. I have worked with various tools including: Python (Flask, Django, Discord API, unittest), Javascript (Node, Express, EJS, socket.io, passport.js), C# scripting in Unity, SQL (MySQL, AWS RDS) and NoSQL databases (MongoDB, Firestore), Docker, CI/CD (GitHub Actions), monitoring (Prometheus, Grafana) and Linux (System Administration Fundamentals). I’m hoping to learn many more over the course of my career, and collaborate to make amazing projects together!",
        "hobbies": [{"hobbyName": "Exercising", "hobbyDesc": "The hobby that I enjoy the most is exercising. I have been training for the last 4 years, I started with weight-lifting, then I began long-distance running, and these days I do both! I train every day after work, and I find it helps me relax after a long day of coding."}, {"hobbyName": "Japanese", "hobbyDesc": "I am a huge fan of Japanese culture, and my favourite thing about Japan is the language! Japanese is an intricate language that takes a lifetime to master. I have been studying Japanese on my own for 7 years now, and I can speak fluently with my friends. I can read simple things like manga as well."}, {"hobbyName": "Piano", "hobbyDesc": "I started playing the piano when I was 9, although, to be completely fair, I stopped practicing so much after I graduated high-school. Music has always been a big part of my life though, and I find myself applying musical concepts in the soundtracks of the games I develop."}, {"hobbyName": "Game Development", "hobbyDesc": "As a kid, I loved making games in pen and paper and playing alone or with friends. Eventually, this led me to making a few simple terminal-based games in Java, and finally using Unity to make the game development process a lot quicker! I’ve even deployed one of my games on the Google Play Store!"}],
        "experience": [{"expName": "Production Engineer Fellow @ Major League Hacking", "expDesc": "Internship alternative sponsored by Meta. I learned about Site Reliability Engineering/Devops, while being mentored by Meta Production Engineers! We learned many things, including: Containers, Testing, CI/CD, Monitoring as well as Systems Administration in Linux. The weekly 1:1 meetings with my mentors were extremely valuable to my professional development."},{"expName": "British Columbia Institute of Technology", "expDesc": "I’m a Computer Systems Technology student at BCIT, in Vancouver. BCIT is a Technical School that emphasizes practical knowledge over theory. Here I’m learning a lot about collaboration, Agile development, Test-driven development, software best practices and many other things that regular universities usually don’t cover."}],
        "projects": [
            {"projName": "Bonfire",
             "projDesc": "A social app for civil discussion. Made with Express, Node.js, MySQL, EJS and Bootstrap. Cloud MySQL solution provided by AWS Redis. Best viewed on mobile devices!",
             "projUrl": "https://thebonfireapp.herokuapp.com"},
            {"projName": "Travelr",
             "projDesc": "A social app that helps people make groups to share accommodation in big cities. Made with Bootstrap, Javascript and Firebase Store.",
             "projUrl": "https://travelr-bcit.netlify.app"},
            {"projName": "Crate Smasher",
             "projDesc": "A casual game for Android. Every single asset in the game was hand-crafted by me! Made with Unity and C#.",
             "projUrl": "https://play.google.com/store/apps/details?id=com.MaxwellGames.CrateSmasher"},
            {"projName": "H-mart",
             "projDesc": "A blockchain project based on Hedera's Javascript API. Won a prize on MLH StormHacks2022!",
             "projUrl": "https://github.com/jescalada/h-mart"},
            {"projName": "Chris: The Game",
             "projDesc": "A comical trivia game made with Node.js and React. Won a prize on BCIT Hack The Break 2022!",
             "projUrl": "https://chris-the-game.netlify.app"},
            {"projName": "Team Pythonic Portfolio",
             "projDesc": "A reusable, mobile-friendly portfolio template made in Python. Won a prize on MLH Fellowship Orientation Hackathon Summer 2022!",
             "projUrl": "https://jescalada.duckdns.org"}],
        "places": [{"country": "Canada", "lat": 45.421532, "long": -75.697189}, {"country": "Argentina", "lat": -34.603683, "long": -58.381557}, {"country": "Mexico", "lat": 19.432608, "long": -99.133209}, {"country": "US", "lat": 38.9071923, "long": -77.0368707}, {"country": "Brazil", "lat": -15.793889, "long": -47.882778}, {"country": "Panama", "lat": 8.983333, "long": -79.516670}, {"country": "Dominican Republic", "lat": 18.483402, "long": -69.929611}, {"country": "Jamaica", "lat": 18.017874, "long": -76.809904}, {"country": "Paraguay", "lat": -25.263740, "long": -57.575926}, {"country": "UK", "lat": 51.509865, "long": -0.118092}, {"country": "France", "lat": 48.864716, "long": 2.349014}, {"country": "Spain", "lat": 40.416775, "long": -3.703790}],
        "links": [{"urlName": "linkedin", "url": "https://www.linkedin.com/in/jescalada"}, {"urlName": "github", "url": "https://github.com/jescalada"}]
    }
}
